yellow-new/TMS320F280049_STU/Workspace/TMS320F28004X_Sci/Source/ChipDevice/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL3 register
//
//*************************************************************************************************
#define GPIO_GPBCSEL3_GPIO48_S   0U
#define GPIO_GPBCSEL3_GPIO48_M   0xFU          // GPIO48 Master CPU Select
#define GPIO_GPBCSEL3_GPIO49_S   4U
#define GPIO_GPBCSEL3_GPIO49_M   0xF0U         // GPIO49 Master CPU Select
#define GPIO_GPBCSEL3_GPIO50_S   8U
#define GPIO_GPBCSEL3_GPIO50_M   0xF00U        // GPIO50 Master CPU Select
#define GPIO_GPBCSEL3_GPIO51_S   12U
#define GPIO_GPBCSEL3_GPIO51_M   0xF000U       // GPIO51 Master CPU Select
#define GPIO_GPBCSEL3_GPIO52_S   16U
#define GPIO_GPBCSEL3_GPIO52_M   0xF0000U      // GPIO52 Master CPU Select
#define GPIO_GPBCSEL3_GPIO53_S   20U
#define GPIO_GPBCSEL3_GPIO53_M   0xF00000U     // GPIO53 Master CPU Select
#define GPIO_GPBCSEL3_GPIO54_S   24U
#define GPIO_GPBCSEL3_GPIO54_M   0xF000000U    // GPIO54 Master CPU Select
#define GPIO_GPBCSEL3_GPIO55_S   28U
#define GPIO_GPBCSEL3_GPIO55_M   0xF0000000U   // GPIO55 Master CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL4 register
//
//*************************************************************************************************
#define GPIO_GPBCSEL4_GPIO56_S   0U
#define GPIO_GPBCSEL4_GPIO56_M   0xFU      // GPIO56 Master CPU Select
#define GPIO_GPBCSEL4_GPIO57_S   4U
#define GPIO_GPBCSEL4_GPIO57_M   0xF0U     // GPIO57 Master CPU Select
#define GPIO_GPBCSEL4_GPIO58_S   8U
#define GPIO_GPBCSEL4_GPIO58_M   0xF00U    // GPIO58 Master CPU Select
#define GPIO_GPBCSEL4_GPIO59_S   12U
#define GPIO_GPBCSEL4_GPIO59_M   0xF000U   // GPIO59 Master CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBLOCK register
//
//*************************************************************************************************
#define GPIO_GPBLOCK_GPIO32   0x1U         // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO33   0x2U         // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO34   0x4U         // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO35   0x8U         // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO37   0x20U        // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO39   0x80U        // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO40   0x100U       // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO41   0x200U       // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO42   0x400U       // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO43   0x800U       // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO44   0x1000U      // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO45   0x2000U      // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO46   0x4000U      // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO47   0x8000U      // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO48   0x10000U     // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO49   0x20000U     // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO50   0x40000U     // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO51   0x80000U     // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO52   0x100000U    // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO53   0x200000U    // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO54   0x400000U    // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO55   0x800000U    // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO56   0x1000000U   // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO57   0x2000000U   // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO58   0x4000000U   // Configuration Lock bit for this pin
#define GPIO_GPBLOCK_GPIO59   0x8000000U   // Configuration Lock bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBCR register
//
//*************************************************************************************************
#define GPIO_GPBCR_GPIO32   0x1U         // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO33   0x2U         // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO34   0x4U         // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO35   0x8U         // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO37   0x20U        // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO39   0x80U        // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO40   0x100U       // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO41   0x200U       // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO42   0x400U       // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO43   0x800U       // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO44   0x1000U      // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO45   0x2000U      // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO46   0x4000U      // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO47   0x8000U      // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO48   0x10000U     // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO49   0x20000U     // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO50   0x40000U     // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO51   0x80000U     // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO52   0x100000U    // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO53   0x200000U    // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO54   0x400000U    // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO55   0x800000U    // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO56   0x1000000U   // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO57   0x2000000U   // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO58   0x4000000U   // Configuration lock commit bit for this pin
#define GPIO_GPBCR_GPIO59   0x8000000U   // Configuration lock commit bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCTRL register
//
//*************************************************************************************************
#define GPIO_GPHCTRL_QUALPRD0_S   0U
#define GPIO_GPHCTRL_QUALPRD0_M   0xFFU       // Qualification sampling period for GPIO224 to
                                              // GPIO231
#define GPIO_GPHCTRL_QUALPRD1_S   8U
#define GPIO_GPHCTRL_QUALPRD1_M   0xFF00U     // Qualification sampling period for GPIO232 to
                                              // GPIO239
#define GPIO_GPHCTRL_QUALPRD2_S   16U
#define GPIO_GPHCTRL_QUALPRD2_M   0xFF0000U   // Qualification sampling period for GPIO240 to
                                              // GPIO247

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHQSEL1 register
//
//*************************************************************************************************
#define GPIO_GPHQSEL1_GPIO224_S   0U
#define GPIO_GPHQSEL1_GPIO224_M   0x3U          // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO225_S   2U
#define GPIO_GPHQSEL1_GPIO225_M   0xCU          // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO226_S   4U
#define GPIO_GPHQSEL1_GPIO226_M   0x30U         // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO227_S   6U
#define GPIO_GPHQSEL1_GPIO227_M   0xC0U         // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO228_S   8U
#define GPIO_GPHQSEL1_GPIO228_M   0x300U        // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO229_S   10U
#define GPIO_GPHQSEL1_GPIO229_M   0xC00U        // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO230_S   12U
#define GPIO_GPHQSEL1_GPIO230_M   0x3000U       // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO231_S   14U
#define GPIO_GPHQSEL1_GPIO231_M   0xC000U       // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO232_S   16U
#define GPIO_GPHQSEL1_GPIO232_M   0x30000U      // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO233_S   18U
#define GPIO_GPHQSEL1_GPIO233_M   0xC0000U      // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO234_S   20U
#define GPIO_GPHQSEL1_GPIO234_M   0x300000U     // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO235_S   22U
#define GPIO_GPHQSEL1_GPIO235_M   0xC00000U     // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO236_S   24U
#define GPIO_GPHQSEL1_GPIO236_M   0x3000000U    // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO237_S   26U
#define GPIO_GPHQSEL1_GPIO237_M   0xC000000U    // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO238_S   28U
#define GPIO_GPHQSEL1_GPIO238_M   0x30000000U   // Select input qualification type for this GPIO
                                                // Pin
#define GPIO_GPHQSEL1_GPIO239_S   30U
#define GPIO_GPHQSEL1_GPIO239_M   0xC0000000U   // Select input qualification type for this GPIO
                                                // Pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHQSEL2 register
//
//*************************************************************************************************
#define GPIO_GPHQSEL2_GPIO240_S   0U
#define GPIO_GPHQSEL2_GPIO240_M   0x3U      // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO241_S   2U
#define GPIO_GPHQSEL2_GPIO241_M   0xCU      // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO242_S   4U
#define GPIO_GPHQSEL2_GPIO242_M   0x30U     // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO243_S   6U
#define GPIO_GPHQSEL2_GPIO243_M   0xC0U     // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO244_S   8U
#define GPIO_GPHQSEL2_GPIO244_M   0x300U    // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO245_S   10U
#define GPIO_GPHQSEL2_GPIO245_M   0xC00U    // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO246_S   12U
#define GPIO_GPHQSEL2_GPIO246_M   0x3000U   // Select input qualification type for this GPIO Pin
#define GPIO_GPHQSEL2_GPIO247_S   14U
#define GPIO_GPHQSEL2_GPIO247_M   0xC000U   // Select input qualification type for this GPIO Pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHPUD register
//
//*************************************************************************************************
#define GPIO_GPHPUD_GPIO224   0x1U        // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO225   0x2U        // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO226   0x4U        // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO227   0x8U        // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO228   0x10U       // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO229   0x20U       // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO230   0x40U       // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO231   0x80U       // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO232   0x100U      // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO233   0x200U      // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO234   0x400U      // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO235   0x800U      // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO236   0x1000U     // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO237   0x2000U     // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO238   0x4000U     // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO239   0x8000U     // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO240   0x10000U    // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO241   0x20000U    // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO242   0x40000U    // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO243   0x80000U    // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO244   0x100000U   // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO245   0x200000U   // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO246   0x400000U   // Pull-Up Disable control for this pin
#define GPIO_GPHPUD_GPIO247   0x800000U   // Pull-Up Disable control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHINV register
//
//*************************************************************************************************
#define GPIO_GPHINV_GPIO224   0x1U        // Input inversion control for this pin
#define GPIO_GPHINV_GPIO225   0x2U        // Input inversion control for this pin
#define GPIO_GPHINV_GPIO226   0x4U        // Input inversion control for this pin
#define GPIO_GPHINV_GPIO227   0x8U        // Input inversion control for this pin
#define GPIO_GPHINV_GPIO228   0x10U       // Input inversion control for this pin
#define GPIO_GPHINV_GPIO229   0x20U       // Input inversion control for this pin
#define GPIO_GPHINV_GPIO230   0x40U       // Input inversion control for this pin
#define GPIO_GPHINV_GPIO231   0x80U       // Input inversion control for this pin
#define GPIO_GPHINV_GPIO232   0x100U      // Input inversion control for this pin
#define GPIO_GPHINV_GPIO233   0x200U      // Input inversion control for this pin
#define GPIO_GPHINV_GPIO234   0x400U      // Input inversion control for this pin
#define GPIO_GPHINV_GPIO235   0x800U      // Input inversion control for this pin
#define GPIO_GPHINV_GPIO236   0x1000U     // Input inversion control for this pin
#define GPIO_GPHINV_GPIO237   0x2000U     // Input inversion control for this pin
#define GPIO_GPHINV_GPIO238   0x4000U     // Input inversion control for this pin
#define GPIO_GPHINV_GPIO239   0x8000U     // Input inversion control for this pin
#define GPIO_GPHINV_GPIO240   0x10000U    // Input inversion control for this pin
#define GPIO_GPHINV_GPIO241   0x20000U    // Input inversion control for this pin
#define GPIO_GPHINV_GPIO242   0x40000U    // Input inversion control for this pin
#define GPIO_GPHINV_GPIO243   0x80000U    // Input inversion control for this pin
#define GPIO_GPHINV_GPIO244   0x100000U   // Input inversion control for this pin
#define GPIO_GPHINV_GPIO245   0x200000U   // Input inversion control for this pin
#define GPIO_GPHINV_GPIO246   0x400000U   // Input inversion control for this pin
#define GPIO_GPHINV_GPIO247   0x800000U   // Input inversion control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHAMSEL register
//
//*************************************************************************************************
#define GPIO_GPHAMSEL_GPIO224   0x1U        // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO225   0x2U        // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO226   0x4U        // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO227   0x8U        // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO228   0x10U       // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO229   0x20U       // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO230   0x40U       // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO231   0x80U       // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO232   0x100U      // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO233   0x200U      // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO234   0x400U      // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO235   0x800U      // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO236   0x1000U     // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO237   0x2000U     // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO238   0x4000U     // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO239   0x8000U     // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO240   0x10000U    // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO241   0x20000U    // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO242   0x40000U    // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO243   0x80000U    // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO244   0x100000U   // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO245   0x200000U   // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO246   0x400000U   // Analog Mode select for this pin
#define GPIO_GPHAMSEL_GPIO247   0x800000U   // Analog Mode select for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHLOCK register
//
//*************************************************************************************************
#define GPIO_GPHLOCK_GPIO224   0x1U        // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO225   0x2U        // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO226   0x4U        // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO227   0x8U        // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO228   0x10U       // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO229   0x20U       // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO230   0x40U       // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO231   0x80U       // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO232   0x100U      // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO233   0x200U      // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO234   0x400U      // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO235   0x800U      // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO236   0x1000U     // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO237   0x2000U     // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO238   0x4000U     // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO239   0x8000U     // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO240   0x10000U    // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO241   0x20000U    // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO242   0x40000U    // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO243   0x80000U    // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO244   0x100000U   // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO245   0x200000U   // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO246   0x400000U   // Configuration Lock bit for this pin
#define GPIO_GPHLOCK_GPIO247   0x800000U   // Configuration Lock bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCR register
//
//*************************************************************************************************
#define GPIO_GPHCR_GPIO224   0x1U        // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO225   0x2U        // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO226   0x4U        // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO227   0x8U        // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO228   0x10U       // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO229   0x20U       // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO230   0x40U       // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO231   0x80U       // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO232   0x100U      // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO233   0x200U      // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO234   0x400U      // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO235   0x800U      // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO236   0x1000U     // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO237   0x2000U     // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO238   0x4000U     // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO239   0x8000U     // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO240   0x10000U    // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO241   0x20000U    // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO242   0x40000U    // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO243   0x80000U    // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO244   0x100000U   // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO245   0x200000U   // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO246   0x400000U   // Configuration lock commit bit for this pin
#define GPIO_GPHCR_GPIO247   0x800000U   // Configuration lock commit bit for this pin


