yellow-new/TMS320F280049_STU/Workspace/TMS320F28004X_Sci/Source/ChipDevice/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPADAT register
//
//*************************************************************************************************
#define GPIO_GPADAT_GPIO0    0x1U          // Data Register for this pin
#define GPIO_GPADAT_GPIO1    0x2U          // Data Register for this pin
#define GPIO_GPADAT_GPIO2    0x4U          // Data Register for this pin
#define GPIO_GPADAT_GPIO3    0x8U          // Data Register for this pin
#define GPIO_GPADAT_GPIO4    0x10U         // Data Register for this pin
#define GPIO_GPADAT_GPIO5    0x20U         // Data Register for this pin
#define GPIO_GPADAT_GPIO6    0x40U         // Data Register for this pin
#define GPIO_GPADAT_GPIO7    0x80U         // Data Register for this pin
#define GPIO_GPADAT_GPIO8    0x100U        // Data Register for this pin
#define GPIO_GPADAT_GPIO9    0x200U        // Data Register for this pin
#define GPIO_GPADAT_GPIO10   0x400U        // Data Register for this pin
#define GPIO_GPADAT_GPIO11   0x800U        // Data Register for this pin
#define GPIO_GPADAT_GPIO12   0x1000U       // Data Register for this pin
#define GPIO_GPADAT_GPIO13   0x2000U       // Data Register for this pin
#define GPIO_GPADAT_GPIO14   0x4000U       // Data Register for this pin
#define GPIO_GPADAT_GPIO15   0x8000U       // Data Register for this pin
#define GPIO_GPADAT_GPIO16   0x10000U      // Data Register for this pin
#define GPIO_GPADAT_GPIO17   0x20000U      // Data Register for this pin
#define GPIO_GPADAT_GPIO18   0x40000U      // Data Register for this pin
#define GPIO_GPADAT_GPIO19   0x80000U      // Data Register for this pin
#define GPIO_GPADAT_GPIO20   0x100000U     // Data Register for this pin
#define GPIO_GPADAT_GPIO21   0x200000U     // Data Register for this pin
#define GPIO_GPADAT_GPIO22   0x400000U     // Data Register for this pin
#define GPIO_GPADAT_GPIO23   0x800000U     // Data Register for this pin
#define GPIO_GPADAT_GPIO24   0x1000000U    // Data Register for this pin
#define GPIO_GPADAT_GPIO25   0x2000000U    // Data Register for this pin
#define GPIO_GPADAT_GPIO26   0x4000000U    // Data Register for this pin
#define GPIO_GPADAT_GPIO27   0x8000000U    // Data Register for this pin
#define GPIO_GPADAT_GPIO28   0x10000000U   // Data Register for this pin
#define GPIO_GPADAT_GPIO29   0x20000000U   // Data Register for this pin
#define GPIO_GPADAT_GPIO30   0x40000000U   // Data Register for this pin
#define GPIO_GPADAT_GPIO31   0x80000000U   // Data Register for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPASET register
//
//*************************************************************************************************
#define GPIO_GPASET_GPIO0    0x1U          // Output Set bit for this pin
#define GPIO_GPASET_GPIO1    0x2U          // Output Set bit for this pin
#define GPIO_GPASET_GPIO2    0x4U          // Output Set bit for this pin
#define GPIO_GPASET_GPIO3    0x8U          // Output Set bit for this pin
#define GPIO_GPASET_GPIO4    0x10U         // Output Set bit for this pin
#define GPIO_GPASET_GPIO5    0x20U         // Output Set bit for this pin
#define GPIO_GPASET_GPIO6    0x40U         // Output Set bit for this pin
#define GPIO_GPASET_GPIO7    0x80U         // Output Set bit for this pin
#define GPIO_GPASET_GPIO8    0x100U        // Output Set bit for this pin
#define GPIO_GPASET_GPIO9    0x200U        // Output Set bit for this pin
#define GPIO_GPASET_GPIO10   0x400U        // Output Set bit for this pin
#define GPIO_GPASET_GPIO11   0x800U        // Output Set bit for this pin
#define GPIO_GPASET_GPIO12   0x1000U       // Output Set bit for this pin
#define GPIO_GPASET_GPIO13   0x2000U       // Output Set bit for this pin
#define GPIO_GPASET_GPIO14   0x4000U       // Output Set bit for this pin
#define GPIO_GPASET_GPIO15   0x8000U       // Output Set bit for this pin
#define GPIO_GPASET_GPIO16   0x10000U      // Output Set bit for this pin
#define GPIO_GPASET_GPIO17   0x20000U      // Output Set bit for this pin
#define GPIO_GPASET_GPIO18   0x40000U      // Output Set bit for this pin
#define GPIO_GPASET_GPIO19   0x80000U      // Output Set bit for this pin
#define GPIO_GPASET_GPIO20   0x100000U     // Output Set bit for this pin
#define GPIO_GPASET_GPIO21   0x200000U     // Output Set bit for this pin
#define GPIO_GPASET_GPIO22   0x400000U     // Output Set bit for this pin
#define GPIO_GPASET_GPIO23   0x800000U     // Output Set bit for this pin
#define GPIO_GPASET_GPIO24   0x1000000U    // Output Set bit for this pin
#define GPIO_GPASET_GPIO25   0x2000000U    // Output Set bit for this pin
#define GPIO_GPASET_GPIO26   0x4000000U    // Output Set bit for this pin
#define GPIO_GPASET_GPIO27   0x8000000U    // Output Set bit for this pin
#define GPIO_GPASET_GPIO28   0x10000000U   // Output Set bit for this pin
#define GPIO_GPASET_GPIO29   0x20000000U   // Output Set bit for this pin
#define GPIO_GPASET_GPIO30   0x40000000U   // Output Set bit for this pin
#define GPIO_GPASET_GPIO31   0x80000000U   // Output Set bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPACLEAR register
//
//*************************************************************************************************
#define GPIO_GPACLEAR_GPIO0    0x1U          // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO1    0x2U          // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO2    0x4U          // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO3    0x8U          // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO4    0x10U         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO5    0x20U         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO6    0x40U         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO7    0x80U         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO8    0x100U        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO9    0x200U        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO10   0x400U        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO11   0x800U        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO12   0x1000U       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO13   0x2000U       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO14   0x4000U       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO15   0x8000U       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO16   0x10000U      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO17   0x20000U      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO18   0x40000U      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO19   0x80000U      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO20   0x100000U     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO21   0x200000U     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO22   0x400000U     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO23   0x800000U     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO24   0x1000000U    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO25   0x2000000U    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO26   0x4000000U    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO27   0x8000000U    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO28   0x10000000U   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO29   0x20000000U   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO30   0x40000000U   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO31   0x80000000U   // Output Clear bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPATOGGLE register
//
//*************************************************************************************************
#define GPIO_GPATOGGLE_GPIO0    0x1U          // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO1    0x2U          // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO2    0x4U          // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO3    0x8U          // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO4    0x10U         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO5    0x20U         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO6    0x40U         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO7    0x80U         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO8    0x100U        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO9    0x200U        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO10   0x400U        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO11   0x800U        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO12   0x1000U       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO13   0x2000U       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO14   0x4000U       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO15   0x8000U       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO16   0x10000U      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO17   0x20000U      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO18   0x40000U      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO19   0x80000U      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO20   0x100000U     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO21   0x200000U     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO22   0x400000U     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO23   0x800000U     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO24   0x1000000U    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO25   0x2000000U    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO26   0x4000000U    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO27   0x8000000U    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO28   0x10000000U   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO29   0x20000000U   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO30   0x40000000U   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO31   0x80000000U   // Output Toggle bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBDAT register
//
//*************************************************************************************************
#define GPIO_GPBDAT_GPIO32   0x1U         // Data Register for this pin
#define GPIO_GPBDAT_GPIO33   0x2U         // Data Register for this pin
#define GPIO_GPBDAT_GPIO34   0x4U         // Data Register for this pin
#define GPIO_GPBDAT_GPIO35   0x8U         // Data Register for this pin
#define GPIO_GPBDAT_GPIO37   0x20U        // Data Register for this pin
#define GPIO_GPBDAT_GPIO39   0x80U        // Data Register for this pin
#define GPIO_GPBDAT_GPIO40   0x100U       // Data Register for this pin
#define GPIO_GPBDAT_GPIO41   0x200U       // Data Register for this pin
#define GPIO_GPBDAT_GPIO42   0x400U       // Data Register for this pin
#define GPIO_GPBDAT_GPIO43   0x800U       // Data Register for this pin
#define GPIO_GPBDAT_GPIO44   0x1000U      // Data Register for this pin
#define GPIO_GPBDAT_GPIO45   0x2000U      // Data Register for this pin
#define GPIO_GPBDAT_GPIO46   0x4000U      // Data Register for this pin
#define GPIO_GPBDAT_GPIO47   0x8000U      // Data Register for this pin
#define GPIO_GPBDAT_GPIO48   0x10000U     // Data Register for this pin
#define GPIO_GPBDAT_GPIO49   0x20000U     // Data Register for this pin
#define GPIO_GPBDAT_GPIO50   0x40000U     // Data Register for this pin
#define GPIO_GPBDAT_GPIO51   0x80000U     // Data Register for this pin
#define GPIO_GPBDAT_GPIO52   0x100000U    // Data Register for this pin
#define GPIO_GPBDAT_GPIO53   0x200000U    // Data Register for this pin
#define GPIO_GPBDAT_GPIO54   0x400000U    // Data Register for this pin
#define GPIO_GPBDAT_GPIO55   0x800000U    // Data Register for this pin
#define GPIO_GPBDAT_GPIO56   0x1000000U   // Data Register for this pin
#define GPIO_GPBDAT_GPIO57   0x2000000U   // Data Register for this pin
#define GPIO_GPBDAT_GPIO58   0x4000000U   // Data Register for this pin
#define GPIO_GPBDAT_GPIO59   0x8000000U   // Data Register for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBSET register
//
//*************************************************************************************************
#define GPIO_GPBSET_GPIO32   0x1U         // Output Set bit for this pin
#define GPIO_GPBSET_GPIO33   0x2U         // Output Set bit for this pin
#define GPIO_GPBSET_GPIO34   0x4U         // Output Set bit for this pin
#define GPIO_GPBSET_GPIO35   0x8U         // Output Set bit for this pin
#define GPIO_GPBSET_GPIO37   0x20U        // Output Set bit for this pin
#define GPIO_GPBSET_GPIO39   0x80U        // Output Set bit for this pin
#define GPIO_GPBSET_GPIO40   0x100U       // Output Set bit for this pin
#define GPIO_GPBSET_GPIO41   0x200U       // Output Set bit for this pin
#define GPIO_GPBSET_GPIO42   0x400U       // Output Set bit for this pin
#define GPIO_GPBSET_GPIO43   0x800U       // Output Set bit for this pin
#define GPIO_GPBSET_GPIO44   0x1000U      // Output Set bit for this pin
#define GPIO_GPBSET_GPIO45   0x2000U      // Output Set bit for this pin
#define GPIO_GPBSET_GPIO46   0x4000U      // Output Set bit for this pin
#define GPIO_GPBSET_GPIO47   0x8000U      // Output Set bit for this pin
#define GPIO_GPBSET_GPIO48   0x10000U     // Output Set bit for this pin
#define GPIO_GPBSET_GPIO49   0x20000U     // Output Set bit for this pin
#define GPIO_GPBSET_GPIO50   0x40000U     // Output Set bit for this pin
#define GPIO_GPBSET_GPIO51   0x80000U     // Output Set bit for this pin
#define GPIO_GPBSET_GPIO52   0x100000U    // Output Set bit for this pin
#define GPIO_GPBSET_GPIO53   0x200000U    // Output Set bit for this pin
#define GPIO_GPBSET_GPIO54   0x400000U    // Output Set bit for this pin
#define GPIO_GPBSET_GPIO55   0x800000U    // Output Set bit for this pin
#define GPIO_GPBSET_GPIO56   0x1000000U   // Output Set bit for this pin
#define GPIO_GPBSET_GPIO57   0x2000000U   // Output Set bit for this pin
#define GPIO_GPBSET_GPIO58   0x4000000U   // Output Set bit for this pin
#define GPIO_GPBSET_GPIO59   0x8000000U   // Output Set bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBCLEAR register
//
//*************************************************************************************************
#define GPIO_GPBCLEAR_GPIO32   0x1U         // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO33   0x2U         // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO34   0x4U         // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO35   0x8U         // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO37   0x20U        // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO39   0x80U        // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO40   0x100U       // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO41   0x200U       // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO42   0x400U       // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO43   0x800U       // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO44   0x1000U      // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO45   0x2000U      // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO46   0x4000U      // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO47   0x8000U      // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO48   0x10000U     // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO49   0x20000U     // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO50   0x40000U     // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO51   0x80000U     // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO52   0x100000U    // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO53   0x200000U    // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO54   0x400000U    // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO55   0x800000U    // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO56   0x1000000U   // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO57   0x2000000U   // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO58   0x4000000U   // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO59   0x8000000U   // Output Clear bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBTOGGLE register
//
//*************************************************************************************************
#define GPIO_GPBTOGGLE_GPIO32   0x1U         // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO33   0x2U         // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO34   0x4U         // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO35   0x8U         // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO37   0x20U        // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO39   0x80U        // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO40   0x100U       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO41   0x200U       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO42   0x400U       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO43   0x800U       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO44   0x1000U      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO45   0x2000U      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO46   0x4000U      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO47   0x8000U      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO48   0x10000U     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO49   0x20000U     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO50   0x40000U     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO51   0x80000U     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO52   0x100000U    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO53   0x200000U    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO54   0x400000U    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO55   0x800000U    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO56   0x1000000U   // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO57   0x2000000U   // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO58   0x4000000U   // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO59   0x8000000U   // Output Toggle bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHDAT register
//
//*************************************************************************************************
#define GPIO_GPHDAT_GPIO224   0x1U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO225   0x2U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO226   0x4U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO227   0x8U        // Data Register for this pin
#define GPIO_GPHDAT_GPIO228   0x10U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO229   0x20U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO230   0x40U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO231   0x80U       // Data Register for this pin
#define GPIO_GPHDAT_GPIO232   0x100U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO233   0x200U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO234   0x400U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO235   0x800U      // Data Register for this pin
#define GPIO_GPHDAT_GPIO236   0x1000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO237   0x2000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO238   0x4000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO239   0x8000U     // Data Register for this pin
#define GPIO_GPHDAT_GPIO240   0x10000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO241   0x20000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO242   0x40000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO243   0x80000U    // Data Register for this pin
#define GPIO_GPHDAT_GPIO244   0x100000U   // Data Register for this pin
#define GPIO_GPHDAT_GPIO245   0x200000U   // Data Register for this pin
#define GPIO_GPHDAT_GPIO246   0x400000U   // Data Register for this pin
#define GPIO_GPHDAT_GPIO247   0x800000U   // Data Register for this pin



#endif
